<?php

function lang($phrase){
 
    static $lang=array(
        //side Bar
        'dash'=>'لوحة التحكم',
        'item1'=>'الأخبار العاجله',
        'item2'=>'التصنيفات',
        'item3'=>'التعليقات',
        'item4'=>'مكتبة الوسائط',
        'item5'=>'الصلاحيات',
        'item6'=>'المنشورات',
        'item7'=>'المستخدمين',
        'item8'=>'التصويتات',
        //status
        "s1"=>"مغعل",
        "s2"=>"غير مفعل",
        //top Bar
        'icon0'=>'ابحث عن....',
        'icon1'=>'الرسائل',
        'icon2'=>'الاشعارات',
        'icon3'=>'المهام',
        'icon4'=>'الملف الشخصي',
        'icon5'=>'تسجيل الخروج',
        'more1'=>'عرض كل الاشعارات',
        'more2'=>'عرض كل الرسائل',
        'more3'=>'عرض كل المهام',
        'icon6'=>'اللغات',
        'l1'=>"العربية",
        'l2'=>"الانجليزية",
        //users
        'utitle'=>'ادارة المستخدمين',
        'uAction1'=>'تعيين كأدمن',
        'uAction2'=>'تغيير الصلاحية',
        'uAction3'=>'الغاء التفعيل',
        'uth1'=>'الاسم',
        'uth2'=>'الايميل',
        'uth3'=>'رقم الهاتف',
        'uth4'=>'تاريخ التسجل',
        'uth5'=>'الحالة',
        'uth6'=>'المفعل',
        'uth7'=>'الحدث',
       
        //posts
        'ptitle'=>'ادارة المنشورات',
        'paction1'=>'اضافة منشور',
        'paction2'=>'حذف المنشورات ',
        'th0'=>'تحديد',
        'th1'=>'العنوان',
        'th2'=>'الصنف',
        'th3'=>'تاريخ الانشاء ',
        'th4'=>'تاريخ النشر',
        'th5'=>'انشاء بواسطة',
        'th6'=>'الحالة',
        'th7'=>'الحدث',
        'th8'=>'المقدمة',
        'th9'=>'المحتوى',
        'th10'=>'الصورة',
        'm1'=>'اضافة منشور',
        'm1o1'=>'نشر',
        'm1o2'=>'الغاء',
        'm2'=>'حذف منشور',
        'm2content'=>'هل انت متاكد من حذف هذه المنشورات؟'  ,
        'm2o1'=>'حذف',
        'm2o2'=>'الغاء',
        'm3'=>'تعديل منشور',
        'm3o1'=>'تحديث',
        'm3o2'=>'الغاء',
        'm5'=>'تفاصيل المنشور',

        //categories
        'ctitle'=>'ادارة التصنيفات',
        'caction1'=>'اضافة تصنيف',
        'caction2'=>'حذف التصنيفات ',
        'cth0'=>'تحديد',
        'cth1'=>'العنوان',
        'cth2'=>'تاريخ الانشاء ',
        'cth3'=>'انشاء بواسطة',
        'cth4'=>'الحالة',
        'cth5'=>'فرعي من',
        'cth6'=>'الحدث',
        'cm1'=>'اضافة تصنيف',
        'cm1o1'=>'نشر',
        'cm1o2'=>'الغاء',
        'cm2'=>'حذف تصنيف',
        'cm2content'=>'هل انت متاكد من حذف هذه التصنيفات؟'  ,
        'cm2o1'=>'حذف',
        'cm2o2'=>'الغاء',
        'cm3'=>'تعديل تصنيف',
        'cm3o1'=>'تحديث',
        'cm3o2'=>'الغاء',
        'cm4'=>'سجل التعديلات'



    );
    return $lang[$phrase];

}
?>